# -*- coding: utf-8 -*-
# 계좌번호 : 55501053242
# 00101753258 - 실제 TEST 계좌
# 00146753258
# 10011702835 - 일반
# 00445100633 - 외화
# 20053468601
# 20053468605
# 20053468606 - 비과세해외
# 55501053242 - demo

# 005930: 삼성전자

# 123320 : 코스피 레버지리
# 233160 : 코스닥 레버리지
# 225040 : 미국S&P500 레버리지
# 236350 : 인도니프티50레버리지
# 204480 : 차이나CSI300레버리지
# 204450 : ChinaH레버리지

Server_Name = "demo.ebestsec.co.kr"
id, passwd, cert_passwd = "cchoi", "1234a", ""

Account_No = "55501053242"
Account_PWD = "1234a"

start_time = "09:00"
stop_time = "15:30"
# stop_time = "23:59"
Term_Min = "01"

# 기준금리 : 0.5 (2020.07.16)
# COFIX : 0.89 (2020.07.16)
# 수수료 : 0.5
# 
# 목표 : 3%
# 물타기 : -3%
# 손절가 : -7%

# 장기보유 목적
Target_Expcode_List = ["005930", "036570", "088980"] # 삼성전자, 엔씨소프트, 맥쿼리인프라

# 홍콩 제외
Target_Frame = {'종목명' : ['코스피 레버지리', '코스닥 레버리지', '미국S&P500 레버리지', '인도니프티50레버리지', '차이나CSI300레버리지'],
                '종목약칭' : ['코스피', '코스닥', '미국', '인도', '중국'],
                '종목코드' : ['123320', '233160', '225040', '236350', '204480'],
                '목표수익' : [1, 1.5, 2, 2.5, 3],
                '물타기' : [-0.5, -1.5, -1, -2, -3],
                '1회매수액' : [200000, 250000, 300000, 150000, 100000],
                '제한총액' : [4000000, 3500000, 3000000, 2500000, 2000000],
                '손절액' : [-7, -7, -7, -7, -7] }

# 홍콩 추가
# Target_Frame = {'종목명' : ['코스피 레버지리', '코스닥 레버리지', '미국S&P500 레버리지', '인도니프티50레버리지', '차이나CSI300레버리지', '홍콩ChinaH레버리지'],
#                 '종목약칭' : ['코스피', '코스닥', '미국', '인도', '중국', '홍콩'],
#                 '종목코드' : ['123320', '233160', '225040', '236350', '204480', '204450'],
#                 '목표수익' : [1, 1.5, 2, 2.5, 3, 3.5],
#                 '물타기' : [-0.5, -1.5, -1, -2, -3, -3.5],
#                 '1회매수액' : [200000, 250000, 300000, 400000, 500000, 600000],
#                 '제한총액' : [40000000, 35000000, 30000000, 25000000, 2000000, 15000000] }